langxing08/nRF52832-BLE-UART/nRF5_SDK_14.2.0_17b948a/project/ble_peripheral/ble_uart/main.c
/** @file
 *
 * @defgroup ble_sdk_uart_over_ble_main main.c
 * @{
 * @ingroup  ble_sdk_app_nus_eval
 * @brief    UART over BLE application main file.
 *
 * This file contains the source code for a sample application that uses the Nordic UART service.
 * This application uses the @ref srvlib_conn_params module.
 */



#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_gatt.h"
#include "app_timer.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "bsp_btn_ble.h"
#include "nrf_drv_timer.h"
#include "nrf_drv_wdt.h"

#if defined (UART_PRESENT)
#include "nrf_uart.h"
#endif
#if defined (UARTE_PRESENT)
#include "nrf_uarte.h"
#endif

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#define HARDWARE_NUMBER					"HW_1.2"
#define SOFTWARE_NUMBER					"SW_1.0.3"
#define FIRMWARE_NUMBER					"FW_14.2.0"

#define APP_BLE_CONN_CFG_TAG            1                                           /**< A tag identifying the SoftDevice BLE configuration. */

#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2        /**< Reply when unsupported features are requested. */

#define DEVICE_NAME                     "BLE_UART"                               /**< Name of device. Will be included in the advertising data. */
#define NUS_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN                  /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_BLE_OBSERVER_PRIO           3                                           /**< Application's BLE observer priority. You shouldn't need to modify this value. */

#define APP_ADV_INTERVAL                MSEC_TO_UNITS(40, UNIT_0_625_MS)			/**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS      0											/**< The advertising timeout (in units of seconds). */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(20, UNIT_1_25_MS)             /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(75, UNIT_1_25_MS)             /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000)                       /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000)                      /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define UART_TX_BUF_SIZE                256                                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                256                                         /**< UART RX buffer size. */

#define WDT_FEED_INTERVALY				APP_TIMER_TICKS(500)						/**< WDT feed interval. */

#define UART_RX_TIMEOUT_INTERVAL		3											/**< uart rx timeout interval(ms). */
const nrf_drv_timer_t TIMER_UART_RX = NRF_DRV_TIMER_INSTANCE(2);					/**< Timer ID: Timer2. */											
static uint8_t 	UART_RX_BUF[UART_RX_BUF_SIZE] = {0};					  			/**< uart receive buffer. */	
static uint16_t UART_RX_STA = 0;

static uint8_t 	device_name[21] = "BLE_UART_112233445566";

APP_TIMER_DEF(wdt_feed_timer_id);													/**< WDT feed delay timer instance. */
BLE_NUS_DEF(m_nus);                                                                 /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */

nrf_drv_wdt_channel_id m_channel_id;	// wdt channel id

static uint16_t adv_interval = APP_ADV_INTERVAL;

static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};


typedef enum
{
	BLE_STATUS_DISCONNECTED = 0,// ble disconnected
	BLE_STATUS_CONNECTED		// ble connected
} ble_status_t;

static ble_status_t ble_status = BLE_STATUS_DISCONNECTED;


typedef struct ble_send_msg_tag{ 
	uint16_t start;		// Data Start Offset
	uint16_t max_len;	// Data Length
	uint8_t  *pdata; 	// Pointer to Data
}ble_send_msg_t; 

ble_send_msg_t g_send_msg;


static uint32_t uart_init(uint32_t baudrate);
static void advertising_init(void);

/**@brief Function for the BLE send data which received by uart.
 *
 * @details This function will unpacking the uart received data,
 *          each packet at most 20 Bytes. 
 *			Then send the unpacket data over BLE until the
 *			ble_nus_string_send not success or send fineshed.
 *  
 * @return NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t send_data(void)
{
	uint16_t temp_len; 
	uint16_t dif_value; 
	uint32_t err_code = NRF_SUCCESS;

	uint8_t *pdata = g_send_msg.pdata; 
	uint16_t start = g_send_msg.start; 
	uint16_t max_len = g_send_msg.max_len; 

	do { 
		dif_value = max_len - start; 
		temp_len = (dif_value > m_ble_nus_max_data_len) ? m_ble_nus_max_data_len : dif_value; // get min data length

