langxing08/nRF52832-BLE-UART/nRF5_SDK_14.2.0_17b948a/project/ble_peripheral/ble_uart/main.c
		err_code = ble_nus_string_send(&m_nus, pdata + start, &temp_len); 
		
//		NRF_LOG_INFO("BLE notify:");
//		NRF_LOG_HEXDUMP_INFO(pdata + start, temp_len);	
		
		if (NRF_SUCCESS == err_code)
		{ 
			start += temp_len;
		}
	} while((NRF_SUCCESS == err_code) && ((max_len - start) > 0)); 

	g_send_msg.start = start;
	
	return err_code; 
}


/**@brief Function for the first time BLE send data.
 * 
 * @details The first time, BLE at most send 7 packets.
 *			Fuction return should be handle at other funchtion , and return 
 *			NRF_ERROR_BUSY and BLE_ERROR_NO_TX_BUFFERS should be regard as normal result,
 *			bacause no start offset changes.
 *
 * @param[in] pdata  Data to be sent.
 * @param[in] len    Length of the data. Amount of sent bytes.
 *
 * @return NRF_SUCCESS on success, otherwise an error code. 
 */
static uint32_t ble_send_data(uint8_t *pdata, uint16_t len)
{ 
	if((NULL == pdata) || (len <= 0))
	{
		return NRF_ERROR_INVALID_PARAM;
	}

	uint32_t err_code = NRF_SUCCESS; 
	g_send_msg.start = 0; 
	g_send_msg.max_len = len; 
	g_send_msg.pdata = pdata; 

	err_code = send_data(); 
	return err_code;
}


/**@brief Function for the second time BLE send data.
 * 
 * @details This function will process BLE send data until finished.
 *
 * @return NRF_SUCCESS on success, otherwise an error code. 
 */
static uint32_t ble_send_more_data(void)
{ 
	uint32_t err_code; 
	uint16_t dif_value; 

	dif_value = g_send_msg.max_len - g_send_msg.start; 
	if((0 == dif_value) || (NULL == g_send_msg.pdata))
	{
		return NRF_SUCCESS;  // After the completion of the data, return
	}

	err_code = send_data();
	return err_code; 
}


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for convert Bluetooth MAC address to string.
 *
 * @param[in] pAddr   Bluetooth MAC address.
 * 
 * @return BD address as a string.
 */
char *Util_convertBdAddr2Str(uint8_t *pAddr)
{
  uint8_t     charCnt;
  char        hex[] = "0123456789ABCDEF";
  static char str[(BLE_GAP_ADDR_LEN << 1)+1];
  char        *pStr = str;

  // Start from end of addr
  pAddr += BLE_GAP_ADDR_LEN;

  for (charCnt = BLE_GAP_ADDR_LEN; charCnt > 0; charCnt--)
  {
    *pStr++ = hex[*--pAddr >> 4];
    *pStr++ = hex[*pAddr & 0x0F];
  }

  pStr = NULL;

  return str;
}


/**@brief Function for wdt feed timers.
 *
 * @details Starts application wdt feed timers.
 */
static void wdt_feed_timers_start(void)
{
	ret_code_t err_code;

    err_code = app_timer_start(wdt_feed_timer_id, WDT_FEED_INTERVALY, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
	
	// device name : BLE_UART + MAC Address
	// Get BLE address.
	ble_gap_addr_t device_addr;
    #if (NRF_SD_BLE_API_VERSION >= 3)
        err_code = sd_ble_gap_addr_get(&device_addr);
    #else
        err_code = sd_ble_gap_address_get(&device_addr);
    #endif
    APP_ERROR_CHECK(err_code);
	
	memcpy(device_name + 9, Util_convertBdAddr2Str(device_addr.addr), (BLE_GAP_ADDR_LEN*2));
	
    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) device_name,
                                          sizeof(device_name));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_nus    Nordic UART Service structure.
 * @param[in] p_data   Data to be send to UART module.
 * @param[in] length   Length of the data.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            do
            {
                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                {
                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                    APP_ERROR_CHECK(err_code);
                }
            } while (err_code == NRF_ERROR_BUSY);
        }
        if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length-1] == '\r')
        {
            while (app_uart_put('\n') == NRF_ERROR_BUSY);
        }
    }

