langxing08/nRF52832-BLE-UART/nRF5_SDK_14.2.0_17b948a/project/ble_peripheral/ble_uart/main.c
}
/**@snippet [Handling the data received over BLE] */


/**@brief Function for check uart received data whether is AT cmd or Pass-through data.
 *
 * @param[in] pBuffer   pointer of string.
 * @param[in] length	Length of the data.
 *
 * @retval 1 AT command
 * @retval 0 Pass-through data
 */
static uint8_t AT_cmd_check_valid(uint8_t *pBuffer, uint16_t length)
{
	// check whether is AT cmd or not	
	if(length < 2) {
		return 0;
	}
			
	if(strncmp((char*)pBuffer, "AT", 2)!=0) {
		return 0;
	}

	return 1;
}


/**@brief Function for process AT command.
 *
 * @param[in] pBuffer   pointer of string.
 * @param[in] length	Length of the data.
 */
static void AT_cmd_handle(uint8_t *pBuffer, uint16_t length)
{
	ret_code_t err_code;
//	uint8_t i;
	
	// AT test: AT?\r\n
	if((length == 5) && (strncmp((char*)pBuffer, "AT?\r\n", 5) == 0))
	{
		printf("AT:OK\r\n");
	}
	
	// System soft reset: AT+RESET\r\n
	else if((length == 10) && (strncmp((char*)pBuffer, "AT+RESET\r\n", 10) == 0))
	{		
		NVIC_SystemReset();	// Restart the system by default	
	}	

	// MAC address check: AT+MAC?\r\n
	else if((length == 9) && (strncmp((char*)pBuffer, "AT+MAC?\r\n", 6) == 0))// check MAC addr
	{
		// Get BLE address.
		ble_gap_addr_t device_addr;
		#if (NRF_SD_BLE_API_VERSION >= 3)
			err_code = sd_ble_gap_addr_get(&device_addr);
		#else
			err_code = sd_ble_gap_address_get(&device_addr);
		#endif
		APP_ERROR_CHECK(err_code);

		printf("AT+MAC:%s\r\n", Util_convertBdAddr2Str(device_addr.addr));
	}
	
	// Hardware/firmware/software version check: AT+VER?\r\n
	else if((length == 9) && (strncmp((char*)pBuffer, "AT+VER?\r\n", 6) == 0))
	{
		printf("AT+VER:%s,%s,%s\r\n", HARDWARE_NUMBER, FIRMWARE_NUMBER, SOFTWARE_NUMBER);	
	}	
	
	// BLE connection status check: AT+STATUS?\r\n
	else if((length == 12) && (strncmp((char*)pBuffer, "AT+STATUS?\r\n", 12) == 0))
	{
		printf("AT+STATUS:%X\r\n", ble_status);//ble_status
	}
	
	// Disconnet connection: AT+DISCON\r\n
	else if((length == 11) && (strncmp((char*)pBuffer, "AT+DISCON\r\n", 11) == 0))
	{
		if(ble_status == BLE_STATUS_CONNECTED)
		{
			err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			if(err_code == NRF_SUCCESS)
			{
				printf("AT+DISCON:OK\r\n");
			}
			else
			{
				printf("AT+DISCON:FAIL\r\n");
			}
			APP_ERROR_CHECK(err_code);
		}
		else
		{
			printf("AT+DISCON:ERP\r\n");
		}
	}

	// Uart baudrate setup: AT+BAUD=N\r\n, N ranges from 0 to 8
	else if((length == 11) && (strncmp((char*)pBuffer, "AT+BAUD=", 8) == 0))//baudrate setup
	{
		uint32_t uart_baudrate[9] = {
						UART_BAUDRATE_BAUDRATE_Baud4800,	// 4800
						UART_BAUDRATE_BAUDRATE_Baud9600, 	// 9600
						UART_BAUDRATE_BAUDRATE_Baud19200, 	// 19200
						UART_BAUDRATE_BAUDRATE_Baud38400, 	// 38400
						UART_BAUDRATE_BAUDRATE_Baud57600, 	// 57600
						UART_BAUDRATE_BAUDRATE_Baud115200, 	// 115200
						UART_BAUDRATE_BAUDRATE_Baud230400, 	// 230400
						UART_BAUDRATE_BAUDRATE_Baud460800,	// 460800
						UART_BAUDRATE_BAUDRATE_Baud921600};	// 921600
		if((pBuffer[8] >= '0') && (pBuffer[8] < '9'))
		{
			app_uart_close();
			err_code = uart_init(uart_baudrate[pBuffer[8] - '0']);
			if(err_code == NRF_SUCCESS)
			{
				printf("AT+BAUD:OK\r\n");
			}
			else
			{
				printf("AT+BAUD:FAIL\r\n");
			}
			APP_ERROR_CHECK(err_code);
		}
		else
		{
			printf("AT+BAUD:ERP\r\n");
		}
	}
	
	// Tx power setup: AT+TXPW=N\r\n, N ranges from 0 to 8
	else if((length == 11) && (strncmp((char*)pBuffer, "AT+TXPW=", 8) == 0))
	{
		int8_t tx_power_level[9] = {-40, -20, -16, -12, -8, -4, 0, 3, 4};
		
		if((pBuffer[8] >= '0') && (pBuffer[8] < '9'))
		{
			err_code = sd_ble_gap_tx_power_set(tx_power_level[pBuffer[8] - '0']);
			if(err_code == NRF_SUCCESS)
			{
				printf("AT+TXPW:OK\r\n");
			}
			else
			{
				printf("AT+TXPW:FAIL\r\n");
			}
			APP_ERROR_CHECK(err_code);		
		}
		else
		{
			printf("AT+TXPW:ERP\r\n");
		}
	}
	
	// Adv interval setup: AT+ADV=<adv_interval>\r\n
	else if((length >= 10) && (strncmp((char*)pBuffer, "AT+ADV=", 7) == 0))
	{
		uint32_t adv_interval_temp;
		sscanf((char*)pBuffer, "AT+ADV=%x\r\n", &adv_interval_temp);
	
		if((adv_interval_temp >= 0x0020) && (adv_interval_temp <= 0x4000))
		{
			adv_interval = adv_interval_temp;
			
			sd_ble_gap_adv_stop();

			advertising_init();
			err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
			if(err_code == NRF_SUCCESS)
			{
				printf("AT+ADV:OK\r\n");
			}
			else
			{
				printf("AT+ADV:FAIL\r\n");
			}
			APP_ERROR_CHECK(err_code);
		}
		else
		{
			printf("AT+ADV:ERP\r\n");
		}
	}
	
// Connection interval setup:AT+CON=<min_connect_interval>,<max_connect_interval>,<slave_latency>,<conn_sup_timeout>\r\n
	else if((length >= 16) && (strncmp((char*)pBuffer, "AT+CON=", 7) == 0))
	{
		ble_gap_conn_params_t   gap_conn_params;
		
		uint32_t min_conn_interval_tmp;	// MIN_CONN_INTERVAL
		uint32_t max_conn_interval_tmp;	// MAX_CONN_INTERVAL
		uint32_t slave_latency_tmp;		// SLAVE_LATENCY
		uint32_t conn_sup_timeout_tmp;	// CONN_SUP_TIMEOUT

		if(ble_status == BLE_STATUS_CONNECTED)
		{
			memset(&gap_conn_params, 0, sizeof(gap_conn_params));

			sscanf((char*)pBuffer, "AT+CON=%x,%x,%x,%x\r\n", 
									&min_conn_interval_tmp,	
									&max_conn_interval_tmp,	
									&slave_latency_tmp,		
									&conn_sup_timeout_tmp);	

//			printf("set connect_interval min:0x%X,max:0x%X,slave_latency:0x%X,timeout:0x%X\r\n", 
//						min_conn_interval_tmp, max_conn_interval_tmp, 
//						slave_latency_tmp, conn_sup_timeout_tmp);
		
			if((min_conn_interval_tmp >= 0x0006) 
				&& (min_conn_interval_tmp <= max_conn_interval_tmp) 
				&& (max_conn_interval_tmp <= 0x0C80) 
				&& (slave_latency_tmp <= 499) 
				&& (conn_sup_timeout_tmp >= 1) 
				&& (conn_sup_timeout_tmp <= 3200)
				&& ((conn_sup_timeout_tmp*10.0) > (1 + slave_latency_tmp)*(max_conn_interval_tmp*5.0/4)))
			{
				gap_conn_params.min_conn_interval = min_conn_interval_tmp;
				gap_conn_params.max_conn_interval = max_conn_interval_tmp;
				gap_conn_params.slave_latency = slave_latency_tmp;
				gap_conn_params.conn_sup_timeout = conn_sup_timeout_tmp;
				
				err_code = sd_ble_gap_conn_param_update(m_conn_handle, &gap_conn_params);
				if(err_code == NRF_SUCCESS)
				{
					printf("AT+CON:OK\r\n");
				}
				else
				{
					printf("AT+CON:FAIL\r\n");
				}
				APP_ERROR_CHECK(err_code);		
				

				err_code = sd_ble_gap_ppcp_get(&gap_conn_params);
				APP_ERROR_CHECK(err_code);
				
				NRF_LOG_INFO("Connect Parameter:%d,%d,%d,%d",
							min_conn_interval_tmp,
							max_conn_interval_tmp,
							slave_latency_tmp,
							conn_sup_timeout_tmp);		
			}
			else
			{
				printf("AT+CON:ERP\r\n");
			}
		}
		else
		{
			printf("AT+CON:ERP\r\n");
		}
	}
	
